---
layout: post
title: Ces journ&eacute;es qui ne font pas 24 heures&hellip;
categories:
- Development
tags:
- JavaScript
- PHP
- Timestamp
comments:
- id: 132000
  content: "Merci pour cet article (ancien maintenant !).\r\nVous proposez des fonctions
    pour js et pour PHP... et en MySQL par exemple ?? \r\nCar  \r\n\r\nADDDATE( CURDATE(),
    INTERVAL 1 DAY ) \r\n\r\najoute 24h , mais cela ne fonctionne pas les jours de
    changements d'heure ..."
---
<p>Profitons du r&eacute;cent passage &agrave; l'heure d'hiver pour rappeler que toutes les journ&eacute;es ne font pas 24 heures!</p>
<p>En effet, entre le dimanche 30 octobre minuit et le lundi 31 minuit, il ne s'est pas &eacute;coul&eacute; 24 mais 25 heures!<!--more--> Voici le d&eacute;compte, en prenant en compte la r&egrave;gle du changement d'heure: ("&agrave; 3h du matin il sera 2h")</p>
<ul>
<li>de 00h00 &agrave; 01h59: 2h</li>
<li>de 02h00 &agrave; 2h59: 1h // premier 'passage'</li>
<li>de 02h00 &agrave; 2h59: 1h // second 'passage'</li>
<li>de 03h00 &agrave; 23h59: 22h</li>
</ul>
<p>=> Total: 25 heures</p>
<p>L'une des cons&eacute;quences est qu'il ne suffit pas d'ajouter 24 heures &agrave; une date pour obtenir la date du jour suivant. Ceci est particuli&egrave;rement important lorsque l'on travail avec des timestamps Unix, car il est tellement simple et plus rapide (&agrave; coder et &agrave; ex&eacute;cuter) de faire un "timestamp += 24*60*60"!</p>
<p>Or le paragraphe pr&eacute;c&eacute;dent vous montre bien que cette pratique va induire un comportement erratique dans votre application.</p>
<p>Il faut donc syst&eacute;matiquement faire appel &agrave; une biblioth&egrave;que de haut niveau qui offre une m&eacute;thode add() prenant en compte les changements d'heure.</p>
<p>Exemple en PHP, avec <a title="DateTime" href="http://www.php.net/manual/en/class.datetime.php" target="_blank" rel="noopener">DateTime</a>:<br />
<!--?prettify linenums=true?--></p>
<pre class="prettyprint">$date = new Datetime('@'.$timestamp);
$date->add(new DateInterval('P1D'));
$newTimestamp = $date->getTimestamp();</pre>
<p>Exemple en JavaScript, avec <a title="DateJS" href="http://www.datejs.com" target="_blank" rel="noopener">date.js</a>:&nbsp;<!--?prettify linenums=true?--></p>
<pre class="prettyprint">var date = new Date(timestamp*1000); // JS travail en nombre de millisecondes
date.add({ days: 1 })</pre>
<p>Pour m&eacute;moire:</p>
<ul>
<li>L'heure l&eacute;gale en France est, durant l'hiver, "l'Heure normale d'Europe centrale", en anglais: "Central European Time", not&eacute;e CET, qui correspond &agrave; une avance d'une heure par rapport &agrave; temps de Greenwich. En &eacute;t&eacute;, il s'agit de "l'Heure d'&eacute;t&eacute; d'Europe centrale" ou "Central European Summer Time" (CEST), qui correspond &agrave; une avance de deux heures.</li>
<li>Le passage &agrave; l'heure d'hiver &agrave; lieu le dernier dimanche d'octobre. A 3h du matin, il sera 2h.: on 'gagne' une heure.</li>
<li>Le passage &agrave; l'heure d'&eacute;t&eacute; &agrave; lieu le dernier dimanche de mars. A 2h du matin, il sera 3h: on 'perd' une heure.</li>
<li>Le principe de changement d'heure se dit "daylight saving time" en anglais.</li>
</ul>
