---
layout: post
title: Encodage .properties Java
categories:
- Development
tags:
- Java
comments: []
---
<p>Faut-il, encore en 2012, enregistrer les fichiers .properties en ISO-8859-1?&nbsp;En bref, la r&eacute;ponse est oui; car certaine m&eacute;thode de la classe Properties ne supporte que cet encodage.<!--more--></p>
<p>La <a href="http://docs.oracle.com/javase/6/docs/api/java/util/Properties.html" target="_blank">javadoc</a> nous indique que les m&eacute;thodes load(InputStream) / store(OutputStream, String) travaillent en ISO-8859-1:</p>
<blockquote>
<p dir="ltr">&laquo; The load(Reader) / store(Writer, String) methods load and store properties from and to a character based stream in a simple line-oriented format specified below. The load(InputStream) / store(OutputStream, String) methods work the same way as the load(Reader)/store(Writer, String) pair, except the input/output stream is encoded in ISO 8859-1 character encoding. &raquo;</p>
</blockquote>
<p>Comme il est <a href="http://fr.wiktionary.org/wiki/pratiquement" target="_blank">pratiquement</a> impossible de certifier qu'un programme ne fasse jamais appel &agrave; ces m&eacute;thodes, les fichiers .properties se doivent d&rsquo;&ecirc;tre en ISO-8859-1 ou alors on courre le risque que certaines String soient mal charg&eacute;es.</p>
<p>&nbsp;</p>
<p>Pour rappel, les caract&egrave;res qui ne sont pas support&eacute;s par ISO-8859-1 sont &agrave; remplacer par une s&eacute;quence d&rsquo;&eacute;chappement Unicode compos&eacute; de la fa&ccedil;on suivante:</p>
<ol>
<li>un backslash &lsquo;&rsquo;</li>
<li>un caract&egrave;re &lsquo;u&rsquo;</li>
<li>un code hexad&eacute;cimal repr&eacute;sentant le caract&egrave;re.</li>
</ol>
<p>Par exemple, le symbole euro (&euro;) s'&eacute;crira u20AC.&nbsp;Une r&eacute;f&eacute;rence des codes Unicode est disponible <a href=" http://www.ssec.wisc.edu/~tomw/java/unicode.html" target="_blank">ici</a>. Mais on pr&eacute;f&eacute;rera surement utiliser l'outil&nbsp;<a href="http://docs.oracle.com/javase/1.4.2/docs/tooldocs/windows/native2ascii.html" target="_blank">native2ascii</a>.</p>
<p>&nbsp;</p>
<p>La p&rsquo;tite question en plus: ISO-8859-1 ou 15, CP1252?&nbsp;La diff&eacute;rence entre ISO-8859-1 et ISO-8859-15 sont assez minimes: 8 caract&egrave;res. Cependant, il convient de noter que le symbole euro (&euro;) est absent en 8859-1 alors qu&rsquo;il est pr&eacute;sent en 8859-15.&nbsp;Les diff&eacute;rences entre 8859-1 et CP1252 sont plus importantes; en plus de l'euro, on notera la pr&eacute;sence du caract&egrave;re &oelig; et du symbole&nbsp;&permil;.&nbsp;En conclusion, un texte en 8859-15 ou en CP1252 sera globalement lisible, mais ne sera pas parfait.</p>
<p>Pour plus d'info, n'h&eacute;sitez pas &agrave; lire les pages Wikipedia sur&nbsp;<a href="http://fr.wikipedia.org/wiki/ISO_8859-15" target="_blank">ISO-8859-15</a>&nbsp;et&nbsp;<a href="http://fr.wikipedia.org/wiki/CP1252" target="_blank">CP1252</a>.</p>
<p>&nbsp;</p>
<p>Sachez, que certains programmes s&rsquo;autorisent quelques largesses. Liferay, par exemple, <a href="http://www.liferay.com/community/wiki/-/wiki/Main/Translating+Liferay+to+a+New+Language" target="_blank">indique</a> que les fichiers .properties contenant les traductions doivent &ecirc;tre en UTF-8:</p>
<blockquote>
<p dir="ltr">Dealing with non-ASCII characters (Version 6.x and later)</p>
<p dir="ltr">Liferay's Language_(Language code).properties files are UTF-8 encoded - this is different from the Java standard, but is an important detail to get your deployment actually working. There's no more transformation required.</p>
</blockquote>
<p dir="ltr">Ah! Soyez sympa: pour vos futurs&nbsp;d&eacute;veloppements, utilisez donc des properties stock&eacute;es dans du XML. Ils sont en UTF-8 par d&eacute;faut, eux!</p>
