---
layout: post
title: "#mysql50#lost+found"
categories:
- Tips &amp; tricks
tags:
- Linux
- MySQL
comments:
- id: 128107
  content: "Ce conseil est affreusement contraire &agrave; FHS !! Selon la Bible http://www.pathname.com/fhs/pub/fhs-2.3.html#MNTMOUNTPOINTFORATEMPORARILYMOUNT\r\n\"The
    content of this directory is a local issue and should not affect the manner in
    which any program is run.\"\r\n&Agrave; moins de faire des bases de donn&eacute;es
    temporaires, ne vaudrait-il pas mettre tout cela dans /var/lib/mysql/data\r\navec
    /var/lib/mysql comme point de montage ?\r\n\r\nMerci quand m&ecirc;me d'avoir
    r&eacute;pondu &agrave; ma requ&ecirc;te google :-)"
---
<p>Vous install&acirc;tes MySQL et le configur&acirc;tes rigoureusement. Vous d&eacute;pla&ccedil;&acirc;tes m&ecirc;me le tablespace sur une partition d&eacute;di&eacute;e, pour des raisons de performance et de maintenance. Vous d&eacute;marriez alors le service, rempli par le sentiment du travail bien fait. Par professionnalisme, vous v&eacute;rifi&acirc;tes les logs; et l&agrave;! Horreur:</p>
<p>[text toolbar="false"]120710 10:14:40 [ERROR] Invalid (old?) table or database name 'lost+found'[/text]<br />
&ldquo;Mais what the f&curren;#k?!&rdquo; vous exclam&acirc;tes vous!</p>
<p>A force d&rsquo;observation, vous d&eacute;couvr&icirc;tes un autre sympt&ocirc;me: la pr&eacute;sence d&rsquo;une base de donn&eacute;e <strong>#mysql50#lost+found</strong><br />
[sql toolbar="false"]mysql> SHOW DATABASES;<br />
+---------------------+<br />
| Database            |<br />
+---------------------+<br />
| information_schema  |<br />
| #mysql50#lost+found |<br />
| mysql               |<br />
| performance_schema  |<br />
+---------------------+<br />
4 rows in set (0.00 sec)[/sql]<br />
C'est pas tr&egrave;s joli tout &ccedil;a et &ccedil;a peut faire planter les scripts de sauvegarde &eacute;crit un peu trop vite&hellip;<!--more--></p>
<p>Dans un &eacute;lan de logique primitive, vous essay&acirc;tes de supprimer la base de donn&eacute;es.<br />
[sql toolbar="false"]mysql> DROP DATABASE '#mysql50#lost+found';<br />
ERROR 1008 (HY000): Can't drop database '#mysql50#lost+found'; database doesn't exist[/sql]</p>
<p>Vous compr&icirc;tes bien vite l&rsquo;origine de cette base de donn&eacute;e: la pr&eacute;sence du dossier lost+found sous le point de montage de votre partition. Avouez-le, l&rsquo;id&eacute;e de supprimer le dossier lost+found vous a m&ecirc;me travers&eacute; l&rsquo;esprit. Mais non, &ccedil;a, c&rsquo;&eacute;tait trop mal!</p>
<p>Lost+found &eacute;tant une caract&eacute;ristique de l&rsquo;extFS, il &eacute;tait toujours possible de changer de syst&egrave;me de fichier; mais il vous sembl&acirc;t que ce fusse un peu extr&ecirc;me comme solution, d&rsquo;autant plus que le choix du FS &eacute;tait le r&eacute;sultat d&rsquo;une &eacute;tude.</p>
<p>Vous vous d&icirc;tes alors qu&rsquo;une petite recherche Google s&rsquo;imposait. Ainsi, vous d&eacute;couvr&icirc;tes que le bug est connu de la communaut&eacute;: ticket <a href="http://bugs.mysql.com/bug.php?id=22615" target="_blank">#22615</a>;&nbsp;et qu&rsquo;il est m&ecirc;me d&eacute;j&agrave; r&eacute;solu: &agrave; partir de la 5.6.3, avec le param&egrave;tre <a href="http://dev.mysql.com/doc/refman/5.6/en/server-options.html#option_mysqld_ignore-db-dir" target="_blank">ignore-db-dir</a>. Malheureusement, vous n&rsquo;aviez pas la libert&eacute; de monter en version...</p>
<p>En cons&eacute;quence, une seule solution s&rsquo;offrait &agrave; vous: d&eacute;placer le tablespace vers un sous-dossier de la partition et reconfigurer votre MySQL</p>
<p>[shell toolbar="false"][mysqld]<br />
datadir=/mnt/mysql/data/[/shell]</p>
